```
SETUP: tests/aws_wafv2_web_acl []

PRETEST: tests/aws_wafv2_web_acl

TEST: tests/aws_wafv2_web_acl
Running terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.firehose_role will be created
  + resource "aws_iam_role" "firehose_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "turbottest69545"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_kinesis_firehose_delivery_stream.named_test_resource will be created
  + resource "aws_kinesis_firehose_delivery_stream" "named_test_resource" {
      + arn            = (known after apply)
      + destination    = "s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-turbottest69545"
      + tags_all       = (known after apply)
      + version_id     = (known after apply)

      + s3_configuration {
          + bucket_arn         = (known after apply)
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "UNCOMPRESSED"
          + role_arn           = (known after apply)

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }
    }

  # aws_s3_bucket.firehose_bucket will be created
  + resource "aws_s3_bucket" "firehose_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "turbottest69545"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_wafv2_web_acl.named_test_resource will be created
  + resource "aws_wafv2_web_acl" "named_test_resource" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Example of a managed rule."
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "turbottest69545"
      + scope       = "REGIONAL"
      + tags        = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all    = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "rule-1"
          + priority = 1

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"

                  + excluded_rule {
                      + name = "SizeRestrictions_QUERYSTRING"
                    }
                  + excluded_rule {
                      + name = "NoUserAgent_HEADER"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "friendly-rule-metric-turbottest69545"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "friendly-metric-turbottest69545"
          + sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl_logging_configuration.example will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "example" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = (known after apply)

      + redacted_fields {

          + single_header {
              + name = "user-agent"
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + log_destination_configs = (known after apply)
  + resource_aka            = (known after apply)
  + resource_id             = (known after apply)
  + resource_name           = "turbottest69545"
aws_iam_role.firehose_role: Creating...
aws_s3_bucket.firehose_bucket: Creating...
aws_wafv2_web_acl.named_test_resource: Creating...
aws_wafv2_web_acl.named_test_resource: Creation complete after 4s [id=68afd404-05d2-4efb-bdbe-dec4b81fd8a0]
aws_iam_role.firehose_role: Creation complete after 4s [id=turbottest69545]
aws_s3_bucket.firehose_bucket: Still creating... [10s elapsed]
aws_s3_bucket.firehose_bucket: Creation complete after 17s [id=turbottest69545]
aws_kinesis_firehose_delivery_stream.named_test_resource: Creating...
aws_kinesis_firehose_delivery_stream.named_test_resource: Still creating... [10s elapsed]
aws_kinesis_firehose_delivery_stream.named_test_resource: Still creating... [20s elapsed]
aws_kinesis_firehose_delivery_stream.named_test_resource: Still creating... [30s elapsed]
aws_kinesis_firehose_delivery_stream.named_test_resource: Still creating... [40s elapsed]
aws_kinesis_firehose_delivery_stream.named_test_resource: Still creating... [50s elapsed]
aws_kinesis_firehose_delivery_stream.named_test_resource: Still creating... [1m0s elapsed]
aws_kinesis_firehose_delivery_stream.named_test_resource: Creation complete after 1m6s [id=arn:aws:firehose:us-east-1:986325076436:deliverystream/aws-waf-logs-turbottest69545]
aws_wafv2_web_acl_logging_configuration.example: Creating...
aws_wafv2_web_acl_logging_configuration.example: Creation complete after 3s [id=arn:aws:wafv2:us-east-1:986325076436:regional/webacl/turbottest69545/68afd404-05d2-4efb-bdbe-dec4b81fd8a0]

Warning: Deprecated Resource

  with data.null_data_source.resource,
  on variables.tf line 43, in data "null_data_source" "resource":
  43: data "null_data_source" "resource" {

The null_data_source was historically used to construct intermediate values
to re-use elsewhere in configuration, the same can now be achieved using
locals

(and one more similar warning elsewhere)

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

log_destination_configs = "arn:aws:firehose:us-east-1:986325076436:deliverystream/aws-waf-logs-turbottest69545"
resource_aka = "arn:aws:wafv2:us-east-1:986325076436:regional/webacl/turbottest69545/68afd404-05d2-4efb-bdbe-dec4b81fd8a0"
resource_id = "68afd404-05d2-4efb-bdbe-dec4b81fd8a0"
resource_name = "turbottest69545"

Running SQL query: test-get-query.sql
[
  {
    "akas": [
      "arn:aws:wafv2:us-east-1:986325076436:regional/webacl/turbottest69545/68afd404-05d2-4efb-bdbe-dec4b81fd8a0"
    ],
    "default_action": {
      "Allow": {
        "CustomRequestHandling": null
      },
      "Block": null
    },
    "description": "Example of a managed rule.",
    "name": "turbottest69545",
    "scope": "REGIONAL",
    "tags_src": [
      {
        "Key": "Tag1",
        "Value": "Value1"
      },
      {
        "Key": "Tag2",
        "Value": "Value2"
      }
    ],
    "title": "turbottest69545",
    "visibility_config": {
      "CloudWatchMetricsEnabled": false,
      "MetricName": "friendly-metric-turbottest69545",
      "SampledRequestsEnabled": false
    }
  }
]
✔ PASSED

Running SQL query: test-hydrate-query.sql
[
  {
    "akas": [
      "arn:aws:wafv2:us-east-1:986325076436:regional/webacl/turbottest69545/68afd404-05d2-4efb-bdbe-dec4b81fd8a0"
    ],
    "logging_configuration": {
      "LogDestinationConfigs": [
        "arn:aws:firehose:us-east-1:986325076436:deliverystream/aws-waf-logs-turbottest69545"
      ],
      "LoggingFilter": null,
      "ManagedByFirewallManager": false,
      "RedactedFields": [
        {
          "AllQueryArguments": null,
          "Body": null,
          "JsonBody": null,
          "Method": null,
          "QueryString": null,
          "SingleHeader": {
            "Name": "user-agent"
          },
          "SingleQueryArgument": null,
          "UriPath": null
        }
      ],
      "ResourceArn": "arn:aws:wafv2:us-east-1:986325076436:regional/webacl/turbottest69545/68afd404-05d2-4efb-bdbe-dec4b81fd8a0"
    },
    "name": "turbottest69545",
    "scope": "REGIONAL",
    "tags": {
      "Tag1": "Value1",
      "Tag2": "Value2"
    },
    "title": "turbottest69545"
  }
]
✔ PASSED

Running SQL query: test-list-query.sql
[
  {
    "akas": [
      "arn:aws:wafv2:us-east-1:986325076436:regional/webacl/turbottest69545/68afd404-05d2-4efb-bdbe-dec4b81fd8a0"
    ],
    "description": "Example of a managed rule.",
    "name": "turbottest69545",
    "scope": "REGIONAL",
    "title": "turbottest69545"
  }
]
✔ PASSED

Running SQL query: test-notfound-query.sql
null
✔ PASSED

POSTTEST: tests/aws_wafv2_web_acl

TEARDOWN: tests/aws_wafv2_web_acl

SUMMARY:

1/1 passed.
```